
var dataStr = '1、霍比特人3：五军之战<br>\<br>\ '+
    '导演： 彼得·杰克逊<br>\ '+
    '主演： 马丁·弗瑞曼 / 伊恩·麦克莱恩 / 理查德·阿米蒂奇 / 凯特·布兰切特 / 更多...<br>\ '+
    '时长： 111分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 动作 奇幻 冒险<br>\ '+
    '年代：2015<br>\ '+
    '剧情介绍：<br>\ '+
    '故事讲述记述霍比特人比尔博.巴金斯与巫师甘道夫和十三名矮人向东旅行横越中土大陆，寻找被恶龙抢占的属于矮人珍贵宝物的探险故事。<br>\<br>\<br>'+
	'2、博物馆奇妙夜3<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+ 
	'3、模仿游戏<br>\<br>\ '+
    '导演： 莫滕·泰杜姆<br>\ '+
    '主演： 本尼迪克特·康伯巴奇 凯拉·奈特莉<br>\ '+
    '时长： 114分钟<br>\ '+
    '地区： 美国 英国<br>\ '+
    '类型： 传记 战争 剧情<br>\ '+
    '年代：2014<br>\ '+
    '剧情介绍：<br>\ '+
    '图灵是著名的同性恋之一，并因为其同性恋倾向而遭到迫害，使得他的职业生涯尽毁...<br>\<br>\<br>'+
	'4、爆裂鼓手<br>\<br>\ '+
	'导演：达米安·沙泽勒<br>\ '+
	'年份：2015<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 英语 其他 爵士<br>\ '+
    '主演： 达米安·沙泽勒 迈尔斯·特勒 J·K·西蒙斯 保罗·雷瑟<br>\ '+
	'时长： 114分钟<br>\ '+
    '剧情介绍：<br>\ '+
    '19岁少年安德鲁（迈尔斯·特勒 Miles Teller 饰）成长在单亲家庭，一心想成为顶级爵士乐鼓…<br>\<br>\<br>'+
	'5、利维坦<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+ 
	'6、冬眠<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+ 
	'7、超体<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'8、陆垚知马利<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'9、魔兽世界<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'10、快枪手<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'11、泡沫之夏<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'12、泰山归来<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'13、忍者神龟2<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'14、惊天魔盗团<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'15、独立日：卷土重来<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'16、寒战2<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'17、致青春：原来你还在这里<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'18、大鱼海棠<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'19、惊天大逆转<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'+
	'20、绝地逃亡<br>\<br>\ '+
    '导演： 肖恩·利维<br>\ '+
    '主演： 本·斯蒂勒 欧文 罗宾·威廉姆斯 米基·鲁尼<br>\ '+
    '时长： 108分钟<br>\ '+
    '地区： 美国<br>\ '+
    '类型： 喜剧 动作 奇幻<br>\ '+
    '年代：2007<br>\ '+
    '剧情介绍：<br>\ '+
    '拉里?达利（本?斯蒂勒 饰）生活似乎不太顺利：经常换工作，居无定所；妻子与他离婚，找了一个证券经纪人，即将再婚，自己在儿子心目中的地位也岌岌可危...<br>\<br>\<br>'
	;


var data = [];
var d = dataStr.split('<br><br><br>');
//console.log(d);
for(var i=0;i<d.length-1;i++){
	var c = d[i].split('<br><br>');
	data.push({
		img:c[0].replace('、',' ')+'.jpg',
		caption:c[0].split('、')[1],
		desc:c[1]
	});
	//console.log(c[0].replace('、',' ')+'.jpg');
	//console.log(c[0].split('、')[1]);
	//console.log(c[1]);
}
//console.log(data);